HAMES2-1st-3/TunnelComfortSystemTesting/include/tc37xa/IfxPsi5_bf.h
/**
 * \file IfxPsi5_bf.h
 * \brief
 * \copyright Copyright (c) 2018 Infineon Technologies AG. All rights reserved.
 *
 *
 * Version: TC37x_TS_V2.6.0.R0
 * Specification: TC3xx Target Specification.V2.6.0
 * MAY BE CHANGED BY USER [yes/no]: No
 *
 *                                 IMPORTANT NOTICE
 *
 *
 * Infineon Technologies AG (Infineon) is supplying this file for use
 * exclusively with Infineon's microcontroller products. This file can be freely
 * distributed within development tools that are supporting such microcontroller
 * products.
 *
 * THIS SOFTWARE IS PROVIDED "AS IS".  NO WARRANTIES, WHETHER EXPRESS, IMPLIED
 * OR STATUTORY, INCLUDING, BUT NOT LIMITED TO, IMPLIED WARRANTIES OF
 * MERCHANTABILITY AND FITNESS FOR A PARTICULAR PURPOSE APPLY TO THIS SOFTWARE.
 * INFINEON SHALL NOT, IN ANY CIRCUMSTANCES, BE LIABLE FOR SPECIAL, INCIDENTAL,
 * OR CONSEQUENTIAL DAMAGES, FOR ANY REASON WHATSOEVER.
 *
 * \defgroup IfxSfr_Psi5_Registers_BitfieldsMask Bitfields mask and offset
 * \ingroup IfxSfr_Psi5_Registers
 * 
 */
#ifndef IFXPSI5_BF_H
#define IFXPSI5_BF_H 1

/******************************************************************************/

/******************************************************************************/

/** \addtogroup IfxSfr_Psi5_Registers_BitfieldsMask
 * \{  */
/** \brief Length for Ifx_PSI5_CLC_Bits.DISR */
#define IFX_PSI5_CLC_DISR_LEN (1u)

/** \brief Mask for Ifx_PSI5_CLC_Bits.DISR */
#define IFX_PSI5_CLC_DISR_MSK (0x1u)

/** \brief Offset for Ifx_PSI5_CLC_Bits.DISR */
#define IFX_PSI5_CLC_DISR_OFF (0u)

/** \brief Length for Ifx_PSI5_CLC_Bits.DISS */
#define IFX_PSI5_CLC_DISS_LEN (1u)

/** \brief Mask for Ifx_PSI5_CLC_Bits.DISS */
#define IFX_PSI5_CLC_DISS_MSK (0x1u)

/** \brief Offset for Ifx_PSI5_CLC_Bits.DISS */
#define IFX_PSI5_CLC_DISS_OFF (1u)

/** \brief Length for Ifx_PSI5_CLC_Bits.EDIS */
#define IFX_PSI5_CLC_EDIS_LEN (1u)

/** \brief Mask for Ifx_PSI5_CLC_Bits.EDIS */
#define IFX_PSI5_CLC_EDIS_MSK (0x1u)

/** \brief Offset for Ifx_PSI5_CLC_Bits.EDIS */
#define IFX_PSI5_CLC_EDIS_OFF (3u)

/** \brief Length for Ifx_PSI5_ID_Bits.MODREV */
#define IFX_PSI5_ID_MODREV_LEN (8u)

/** \brief Mask for Ifx_PSI5_ID_Bits.MODREV */
#define IFX_PSI5_ID_MODREV_MSK (0xffu)

/** \brief Offset for Ifx_PSI5_ID_Bits.MODREV */
#define IFX_PSI5_ID_MODREV_OFF (0u)

/** \brief Length for Ifx_PSI5_ID_Bits.MODTYPE */
#define IFX_PSI5_ID_MODTYPE_LEN (8u)

/** \brief Mask for Ifx_PSI5_ID_Bits.MODTYPE */
#define IFX_PSI5_ID_MODTYPE_MSK (0xffu)

/** \brief Offset for Ifx_PSI5_ID_Bits.MODTYPE */
#define IFX_PSI5_ID_MODTYPE_OFF (8u)

/** \brief Length for Ifx_PSI5_ID_Bits.MODNUM */
#define IFX_PSI5_ID_MODNUM_LEN (16u)

/** \brief Mask for Ifx_PSI5_ID_Bits.MODNUM */
#define IFX_PSI5_ID_MODNUM_MSK (0xffffu)

/** \brief Offset for Ifx_PSI5_ID_Bits.MODNUM */
#define IFX_PSI5_ID_MODNUM_OFF (16u)

/** \brief Length for Ifx_PSI5_FDR_Bits.STEP */
#define IFX_PSI5_FDR_STEP_LEN (10u)

/** \brief Mask for Ifx_PSI5_FDR_Bits.STEP */
#define IFX_PSI5_FDR_STEP_MSK (0x3ffu)

/** \brief Offset for Ifx_PSI5_FDR_Bits.STEP */
#define IFX_PSI5_FDR_STEP_OFF (0u)

/** \brief Length for Ifx_PSI5_FDR_Bits.DM */
#define IFX_PSI5_FDR_DM_LEN (2u)

/** \brief Mask for Ifx_PSI5_FDR_Bits.DM */
#define IFX_PSI5_FDR_DM_MSK (0x3u)

/** \brief Offset for Ifx_PSI5_FDR_Bits.DM */
#define IFX_PSI5_FDR_DM_OFF (14u)

/** \brief Length for Ifx_PSI5_FDR_Bits.RESULT */
#define IFX_PSI5_FDR_RESULT_LEN (10u)

/** \brief Mask for Ifx_PSI5_FDR_Bits.RESULT */
#define IFX_PSI5_FDR_RESULT_MSK (0x3ffu)

/** \brief Offset for Ifx_PSI5_FDR_Bits.RESULT */
#define IFX_PSI5_FDR_RESULT_OFF (16u)

/** \brief Length for Ifx_PSI5_FDRL_Bits.STEP */
#define IFX_PSI5_FDRL_STEP_LEN (10u)

/** \brief Mask for Ifx_PSI5_FDRL_Bits.STEP */
#define IFX_PSI5_FDRL_STEP_MSK (0x3ffu)

/** \brief Offset for Ifx_PSI5_FDRL_Bits.STEP */
#define IFX_PSI5_FDRL_STEP_OFF (0u)

/** \brief Length for Ifx_PSI5_FDRL_Bits.DM */
#define IFX_PSI5_FDRL_DM_LEN (2u)

/** \brief Mask for Ifx_PSI5_FDRL_Bits.DM */
#define IFX_PSI5_FDRL_DM_MSK (0x3u)

/** \brief Offset for Ifx_PSI5_FDRL_Bits.DM */
#define IFX_PSI5_FDRL_DM_OFF (14u)

/** \brief Length for Ifx_PSI5_FDRL_Bits.RESULT */
#define IFX_PSI5_FDRL_RESULT_LEN (10u)

/** \brief Mask for Ifx_PSI5_FDRL_Bits.RESULT */
#define IFX_PSI5_FDRL_RESULT_MSK (0x3ffu)

/** \brief Offset for Ifx_PSI5_FDRL_Bits.RESULT */
#define IFX_PSI5_FDRL_RESULT_OFF (16u)

/** \brief Length for Ifx_PSI5_FDRH_Bits.STEP */
#define IFX_PSI5_FDRH_STEP_LEN (10u)

/** \brief Mask for Ifx_PSI5_FDRH_Bits.STEP */
#define IFX_PSI5_FDRH_STEP_MSK (0x3ffu)

/** \brief Offset for Ifx_PSI5_FDRH_Bits.STEP */
#define IFX_PSI5_FDRH_STEP_OFF (0u)

/** \brief Length for Ifx_PSI5_FDRH_Bits.DM */
#define IFX_PSI5_FDRH_DM_LEN (2u)

/** \brief Mask for Ifx_PSI5_FDRH_Bits.DM */
#define IFX_PSI5_FDRH_DM_MSK (0x3u)

/** \brief Offset for Ifx_PSI5_FDRH_Bits.DM */
#define IFX_PSI5_FDRH_DM_OFF (14u)

/** \brief Length for Ifx_PSI5_FDRH_Bits.RESULT */
#define IFX_PSI5_FDRH_RESULT_LEN (10u)

/** \brief Mask for Ifx_PSI5_FDRH_Bits.RESULT */
#define IFX_PSI5_FDRH_RESULT_MSK (0x3ffu)

/** \brief Offset for Ifx_PSI5_FDRH_Bits.RESULT */
#define IFX_PSI5_FDRH_RESULT_OFF (16u)

/** \brief Length for Ifx_PSI5_FDRT_Bits.STEP */
#define IFX_PSI5_FDRT_STEP_LEN (10u)

/** \brief Mask for Ifx_PSI5_FDRT_Bits.STEP */
#define IFX_PSI5_FDRT_STEP_MSK (0x3ffu)

/** \brief Offset for Ifx_PSI5_FDRT_Bits.STEP */
#define IFX_PSI5_FDRT_STEP_OFF (0u)

/** \brief Length for Ifx_PSI5_FDRT_Bits.DM */
#define IFX_PSI5_FDRT_DM_LEN (2u)

/** \brief Mask for Ifx_PSI5_FDRT_Bits.DM */
#define IFX_PSI5_FDRT_DM_MSK (0x3u)

/** \brief Offset for Ifx_PSI5_FDRT_Bits.DM */
#define IFX_PSI5_FDRT_DM_OFF (14u)

/** \brief Length for Ifx_PSI5_FDRT_Bits.RESULT */
#define IFX_PSI5_FDRT_RESULT_LEN (10u)

/** \brief Mask for Ifx_PSI5_FDRT_Bits.RESULT */
#define IFX_PSI5_FDRT_RESULT_MSK (0x3ffu)

/** \brief Offset for Ifx_PSI5_FDRT_Bits.RESULT */
#define IFX_PSI5_FDRT_RESULT_OFF (16u)

/** \brief Length for Ifx_PSI5_FDRT_Bits.ECS */
#define IFX_PSI5_FDRT_ECS_LEN (3u)

/** \brief Mask for Ifx_PSI5_FDRT_Bits.ECS */
#define IFX_PSI5_FDRT_ECS_MSK (0x7u)

/** \brief Offset for Ifx_PSI5_FDRT_Bits.ECS */
#define IFX_PSI5_FDRT_ECS_OFF (26u)

/** \brief Length for Ifx_PSI5_FDRT_Bits.ECEA */
#define IFX_PSI5_FDRT_ECEA_LEN (1u)

/** \brief Mask for Ifx_PSI5_FDRT_Bits.ECEA */
#define IFX_PSI5_FDRT_ECEA_MSK (0x1u)

