HAMES2-1st-3/TunnelComfortSystemTesting/include/tc37xa/IfxPsi5_bf.h
/** \brief Offset for Ifx_PSI5_GCR_Bits.ETC1 */
#define IFX_PSI5_GCR_ETC1_OFF (9u)

/** \brief Length for Ifx_PSI5_GCR_Bits.ETC2 */
#define IFX_PSI5_GCR_ETC2_LEN (1u)

/** \brief Mask for Ifx_PSI5_GCR_Bits.ETC2 */
#define IFX_PSI5_GCR_ETC2_MSK (0x1u)

/** \brief Offset for Ifx_PSI5_GCR_Bits.ETC2 */
#define IFX_PSI5_GCR_ETC2_OFF (10u)

/** \brief Length for Ifx_PSI5_GCR_Bits.ETC3 */
#define IFX_PSI5_GCR_ETC3_LEN (1u)

/** \brief Mask for Ifx_PSI5_GCR_Bits.ETC3 */
#define IFX_PSI5_GCR_ETC3_MSK (0x1u)

/** \brief Offset for Ifx_PSI5_GCR_Bits.ETC3 */
#define IFX_PSI5_GCR_ETC3_OFF (11u)

/** \brief Length for Ifx_PSI5_GCR_Bits.ETC4 */
#define IFX_PSI5_GCR_ETC4_LEN (1u)

/** \brief Mask for Ifx_PSI5_GCR_Bits.ETC4 */
#define IFX_PSI5_GCR_ETC4_MSK (0x1u)

/** \brief Offset for Ifx_PSI5_GCR_Bits.ETC4 */
#define IFX_PSI5_GCR_ETC4_OFF (12u)

/** \brief Length for Ifx_PSI5_GCR_Bits.CEN0 */
#define IFX_PSI5_GCR_CEN0_LEN (1u)

/** \brief Mask for Ifx_PSI5_GCR_Bits.CEN0 */
#define IFX_PSI5_GCR_CEN0_MSK (0x1u)

/** \brief Offset for Ifx_PSI5_GCR_Bits.CEN0 */
#define IFX_PSI5_GCR_CEN0_OFF (16u)

/** \brief Length for Ifx_PSI5_GCR_Bits.CEN1 */
#define IFX_PSI5_GCR_CEN1_LEN (1u)

/** \brief Mask for Ifx_PSI5_GCR_Bits.CEN1 */
#define IFX_PSI5_GCR_CEN1_MSK (0x1u)

/** \brief Offset for Ifx_PSI5_GCR_Bits.CEN1 */
#define IFX_PSI5_GCR_CEN1_OFF (17u)

/** \brief Length for Ifx_PSI5_GCR_Bits.CEN2 */
#define IFX_PSI5_GCR_CEN2_LEN (1u)

/** \brief Mask for Ifx_PSI5_GCR_Bits.CEN2 */
#define IFX_PSI5_GCR_CEN2_MSK (0x1u)

/** \brief Offset for Ifx_PSI5_GCR_Bits.CEN2 */
#define IFX_PSI5_GCR_CEN2_OFF (18u)

/** \brief Length for Ifx_PSI5_GCR_Bits.CEN3 */
#define IFX_PSI5_GCR_CEN3_LEN (1u)

/** \brief Mask for Ifx_PSI5_GCR_Bits.CEN3 */
#define IFX_PSI5_GCR_CEN3_MSK (0x1u)

/** \brief Offset for Ifx_PSI5_GCR_Bits.CEN3 */
#define IFX_PSI5_GCR_CEN3_OFF (19u)

/** \brief Length for Ifx_PSI5_GCR_Bits.CEN4 */
#define IFX_PSI5_GCR_CEN4_LEN (1u)

/** \brief Mask for Ifx_PSI5_GCR_Bits.CEN4 */
#define IFX_PSI5_GCR_CEN4_MSK (0x1u)

/** \brief Offset for Ifx_PSI5_GCR_Bits.CEN4 */
#define IFX_PSI5_GCR_CEN4_OFF (20u)

/** \brief Length for Ifx_PSI5_CH_IOCR_Bits.ALTI */
#define IFX_PSI5_CH_IOCR_ALTI_LEN (2u)

/** \brief Mask for Ifx_PSI5_CH_IOCR_Bits.ALTI */
#define IFX_PSI5_CH_IOCR_ALTI_MSK (0x3u)

/** \brief Offset for Ifx_PSI5_CH_IOCR_Bits.ALTI */
#define IFX_PSI5_CH_IOCR_ALTI_OFF (0u)

/** \brief Length for Ifx_PSI5_CH_IOCR_Bits.DEPTH */
#define IFX_PSI5_CH_IOCR_DEPTH_LEN (4u)

/** \brief Mask for Ifx_PSI5_CH_IOCR_Bits.DEPTH */
#define IFX_PSI5_CH_IOCR_DEPTH_MSK (0xfu)

/** \brief Offset for Ifx_PSI5_CH_IOCR_Bits.DEPTH */
#define IFX_PSI5_CH_IOCR_DEPTH_OFF (4u)

/** \brief Length for Ifx_PSI5_CH_IOCR_Bits.OIE */
#define IFX_PSI5_CH_IOCR_OIE_LEN (1u)

/** \brief Mask for Ifx_PSI5_CH_IOCR_Bits.OIE */
#define IFX_PSI5_CH_IOCR_OIE_MSK (0x1u)

/** \brief Offset for Ifx_PSI5_CH_IOCR_Bits.OIE */
#define IFX_PSI5_CH_IOCR_OIE_OFF (8u)

/** \brief Length for Ifx_PSI5_CH_IOCR_Bits.IIE */
#define IFX_PSI5_CH_IOCR_IIE_LEN (1u)

/** \brief Mask for Ifx_PSI5_CH_IOCR_Bits.IIE */
#define IFX_PSI5_CH_IOCR_IIE_MSK (0x1u)

/** \brief Offset for Ifx_PSI5_CH_IOCR_Bits.IIE */
#define IFX_PSI5_CH_IOCR_IIE_OFF (9u)

/** \brief Length for Ifx_PSI5_CH_IOCR_Bits.REG */
#define IFX_PSI5_CH_IOCR_REG_LEN (1u)

/** \brief Mask for Ifx_PSI5_CH_IOCR_Bits.REG */
#define IFX_PSI5_CH_IOCR_REG_MSK (0x1u)

/** \brief Offset for Ifx_PSI5_CH_IOCR_Bits.REG */
#define IFX_PSI5_CH_IOCR_REG_OFF (12u)

/** \brief Length for Ifx_PSI5_CH_IOCR_Bits.FEG */
#define IFX_PSI5_CH_IOCR_FEG_LEN (1u)

/** \brief Mask for Ifx_PSI5_CH_IOCR_Bits.FEG */
#define IFX_PSI5_CH_IOCR_FEG_MSK (0x1u)

/** \brief Offset for Ifx_PSI5_CH_IOCR_Bits.FEG */
#define IFX_PSI5_CH_IOCR_FEG_OFF (13u)

/** \brief Length for Ifx_PSI5_CH_IOCR_Bits.CREG */
#define IFX_PSI5_CH_IOCR_CREG_LEN (1u)

/** \brief Mask for Ifx_PSI5_CH_IOCR_Bits.CREG */
#define IFX_PSI5_CH_IOCR_CREG_MSK (0x1u)

/** \brief Offset for Ifx_PSI5_CH_IOCR_Bits.CREG */
#define IFX_PSI5_CH_IOCR_CREG_OFF (14u)

/** \brief Length for Ifx_PSI5_CH_IOCR_Bits.CFEG */
#define IFX_PSI5_CH_IOCR_CFEG_LEN (1u)

/** \brief Mask for Ifx_PSI5_CH_IOCR_Bits.CFEG */
#define IFX_PSI5_CH_IOCR_CFEG_MSK (0x1u)

/** \brief Offset for Ifx_PSI5_CH_IOCR_Bits.CFEG */
#define IFX_PSI5_CH_IOCR_CFEG_OFF (15u)

/** \brief Length for Ifx_PSI5_CH_IOCR_Bits.RXM */
#define IFX_PSI5_CH_IOCR_RXM_LEN (1u)

/** \brief Mask for Ifx_PSI5_CH_IOCR_Bits.RXM */
#define IFX_PSI5_CH_IOCR_RXM_MSK (0x1u)

/** \brief Offset for Ifx_PSI5_CH_IOCR_Bits.RXM */
#define IFX_PSI5_CH_IOCR_RXM_OFF (30u)

/** \brief Length for Ifx_PSI5_CH_IOCR_Bits.TXM */
#define IFX_PSI5_CH_IOCR_TXM_LEN (1u)

/** \brief Mask for Ifx_PSI5_CH_IOCR_Bits.TXM */
#define IFX_PSI5_CH_IOCR_TXM_MSK (0x1u)

/** \brief Offset for Ifx_PSI5_CH_IOCR_Bits.TXM */
#define IFX_PSI5_CH_IOCR_TXM_OFF (31u)

/** \brief Length for Ifx_PSI5_CH_RCRA_Bits.PDL0 */
#define IFX_PSI5_CH_RCRA_PDL0_LEN (5u)

/** \brief Mask for Ifx_PSI5_CH_RCRA_Bits.PDL0 */
#define IFX_PSI5_CH_RCRA_PDL0_MSK (0x1fu)

/** \brief Offset for Ifx_PSI5_CH_RCRA_Bits.PDL0 */
#define IFX_PSI5_CH_RCRA_PDL0_OFF (0u)

/** \brief Length for Ifx_PSI5_CH_RCRA_Bits.PDL1 */
#define IFX_PSI5_CH_RCRA_PDL1_LEN (5u)

/** \brief Mask for Ifx_PSI5_CH_RCRA_Bits.PDL1 */
#define IFX_PSI5_CH_RCRA_PDL1_MSK (0x1fu)

/** \brief Offset for Ifx_PSI5_CH_RCRA_Bits.PDL1 */
#define IFX_PSI5_CH_RCRA_PDL1_OFF (5u)

/** \brief Length for Ifx_PSI5_CH_RCRA_Bits.PDL2 */
#define IFX_PSI5_CH_RCRA_PDL2_LEN (5u)

/** \brief Mask for Ifx_PSI5_CH_RCRA_Bits.PDL2 */
#define IFX_PSI5_CH_RCRA_PDL2_MSK (0x1fu)

/** \brief Offset for Ifx_PSI5_CH_RCRA_Bits.PDL2 */
#define IFX_PSI5_CH_RCRA_PDL2_OFF (10u)

/** \brief Length for Ifx_PSI5_CH_RCRA_Bits.PDL3 */
#define IFX_PSI5_CH_RCRA_PDL3_LEN (5u)

/** \brief Mask for Ifx_PSI5_CH_RCRA_Bits.PDL3 */
#define IFX_PSI5_CH_RCRA_PDL3_MSK (0x1fu)

/** \brief Offset for Ifx_PSI5_CH_RCRA_Bits.PDL3 */
#define IFX_PSI5_CH_RCRA_PDL3_OFF (15u)

/** \brief Length for Ifx_PSI5_CH_RCRA_Bits.PDL4 */
#define IFX_PSI5_CH_RCRA_PDL4_LEN (5u)

