HAMES2-1st-3/TunnelComfortSystemTesting/include/tc37xa/IfxPsi5_bf.h
/** \brief Offset for Ifx_PSI5_CH_SORL_Bits.SD24 */
#define IFX_PSI5_CH_SORL_SD24_OFF (24u)

/** \brief Length for Ifx_PSI5_CH_SORL_Bits.SD25 */
#define IFX_PSI5_CH_SORL_SD25_LEN (1u)

/** \brief Mask for Ifx_PSI5_CH_SORL_Bits.SD25 */
#define IFX_PSI5_CH_SORL_SD25_MSK (0x1u)

/** \brief Offset for Ifx_PSI5_CH_SORL_Bits.SD25 */
#define IFX_PSI5_CH_SORL_SD25_OFF (25u)

/** \brief Length for Ifx_PSI5_CH_SORL_Bits.SD26 */
#define IFX_PSI5_CH_SORL_SD26_LEN (1u)

/** \brief Mask for Ifx_PSI5_CH_SORL_Bits.SD26 */
#define IFX_PSI5_CH_SORL_SD26_MSK (0x1u)

/** \brief Offset for Ifx_PSI5_CH_SORL_Bits.SD26 */
#define IFX_PSI5_CH_SORL_SD26_OFF (26u)

/** \brief Length for Ifx_PSI5_CH_SORL_Bits.SD27 */
#define IFX_PSI5_CH_SORL_SD27_LEN (1u)

/** \brief Mask for Ifx_PSI5_CH_SORL_Bits.SD27 */
#define IFX_PSI5_CH_SORL_SD27_MSK (0x1u)

/** \brief Offset for Ifx_PSI5_CH_SORL_Bits.SD27 */
#define IFX_PSI5_CH_SORL_SD27_OFF (27u)

/** \brief Length for Ifx_PSI5_CH_SORL_Bits.SD28 */
#define IFX_PSI5_CH_SORL_SD28_LEN (1u)

/** \brief Mask for Ifx_PSI5_CH_SORL_Bits.SD28 */
#define IFX_PSI5_CH_SORL_SD28_MSK (0x1u)

/** \brief Offset for Ifx_PSI5_CH_SORL_Bits.SD28 */
#define IFX_PSI5_CH_SORL_SD28_OFF (28u)

/** \brief Length for Ifx_PSI5_CH_SORL_Bits.SD29 */
#define IFX_PSI5_CH_SORL_SD29_LEN (1u)

/** \brief Mask for Ifx_PSI5_CH_SORL_Bits.SD29 */
#define IFX_PSI5_CH_SORL_SD29_MSK (0x1u)

/** \brief Offset for Ifx_PSI5_CH_SORL_Bits.SD29 */
#define IFX_PSI5_CH_SORL_SD29_OFF (29u)

/** \brief Length for Ifx_PSI5_CH_SORL_Bits.SD30 */
#define IFX_PSI5_CH_SORL_SD30_LEN (1u)

/** \brief Mask for Ifx_PSI5_CH_SORL_Bits.SD30 */
#define IFX_PSI5_CH_SORL_SD30_MSK (0x1u)

/** \brief Offset for Ifx_PSI5_CH_SORL_Bits.SD30 */
#define IFX_PSI5_CH_SORL_SD30_OFF (30u)

/** \brief Length for Ifx_PSI5_CH_SORL_Bits.SD31 */
#define IFX_PSI5_CH_SORL_SD31_LEN (1u)

/** \brief Mask for Ifx_PSI5_CH_SORL_Bits.SD31 */
#define IFX_PSI5_CH_SORL_SD31_MSK (0x1u)

/** \brief Offset for Ifx_PSI5_CH_SORL_Bits.SD31 */
#define IFX_PSI5_CH_SORL_SD31_OFF (31u)

/** \brief Length for Ifx_PSI5_CH_SORH_Bits.SD32 */
#define IFX_PSI5_CH_SORH_SD32_LEN (1u)

/** \brief Mask for Ifx_PSI5_CH_SORH_Bits.SD32 */
#define IFX_PSI5_CH_SORH_SD32_MSK (0x1u)

/** \brief Offset for Ifx_PSI5_CH_SORH_Bits.SD32 */
#define IFX_PSI5_CH_SORH_SD32_OFF (0u)

/** \brief Length for Ifx_PSI5_CH_SORH_Bits.SD33 */
#define IFX_PSI5_CH_SORH_SD33_LEN (1u)

/** \brief Mask for Ifx_PSI5_CH_SORH_Bits.SD33 */
#define IFX_PSI5_CH_SORH_SD33_MSK (0x1u)

/** \brief Offset for Ifx_PSI5_CH_SORH_Bits.SD33 */
#define IFX_PSI5_CH_SORH_SD33_OFF (1u)

/** \brief Length for Ifx_PSI5_CH_SORH_Bits.SD34 */
#define IFX_PSI5_CH_SORH_SD34_LEN (1u)

/** \brief Mask for Ifx_PSI5_CH_SORH_Bits.SD34 */
#define IFX_PSI5_CH_SORH_SD34_MSK (0x1u)

/** \brief Offset for Ifx_PSI5_CH_SORH_Bits.SD34 */
#define IFX_PSI5_CH_SORH_SD34_OFF (2u)

/** \brief Length for Ifx_PSI5_CH_SORH_Bits.SD35 */
#define IFX_PSI5_CH_SORH_SD35_LEN (1u)

/** \brief Mask for Ifx_PSI5_CH_SORH_Bits.SD35 */
#define IFX_PSI5_CH_SORH_SD35_MSK (0x1u)

/** \brief Offset for Ifx_PSI5_CH_SORH_Bits.SD35 */
#define IFX_PSI5_CH_SORH_SD35_OFF (3u)

/** \brief Length for Ifx_PSI5_CH_SORH_Bits.SD36 */
#define IFX_PSI5_CH_SORH_SD36_LEN (1u)

/** \brief Mask for Ifx_PSI5_CH_SORH_Bits.SD36 */
#define IFX_PSI5_CH_SORH_SD36_MSK (0x1u)

/** \brief Offset for Ifx_PSI5_CH_SORH_Bits.SD36 */
#define IFX_PSI5_CH_SORH_SD36_OFF (4u)

/** \brief Length for Ifx_PSI5_CH_SORH_Bits.SD37 */
#define IFX_PSI5_CH_SORH_SD37_LEN (1u)

/** \brief Mask for Ifx_PSI5_CH_SORH_Bits.SD37 */
#define IFX_PSI5_CH_SORH_SD37_MSK (0x1u)

/** \brief Offset for Ifx_PSI5_CH_SORH_Bits.SD37 */
#define IFX_PSI5_CH_SORH_SD37_OFF (5u)

/** \brief Length for Ifx_PSI5_CH_SORH_Bits.SD38 */
#define IFX_PSI5_CH_SORH_SD38_LEN (1u)

/** \brief Mask for Ifx_PSI5_CH_SORH_Bits.SD38 */
#define IFX_PSI5_CH_SORH_SD38_MSK (0x1u)

/** \brief Offset for Ifx_PSI5_CH_SORH_Bits.SD38 */
#define IFX_PSI5_CH_SORH_SD38_OFF (6u)

/** \brief Length for Ifx_PSI5_CH_SORH_Bits.SD39 */
#define IFX_PSI5_CH_SORH_SD39_LEN (1u)

/** \brief Mask for Ifx_PSI5_CH_SORH_Bits.SD39 */
#define IFX_PSI5_CH_SORH_SD39_MSK (0x1u)

/** \brief Offset for Ifx_PSI5_CH_SORH_Bits.SD39 */
#define IFX_PSI5_CH_SORH_SD39_OFF (7u)

/** \brief Length for Ifx_PSI5_CH_SORH_Bits.SD40 */
#define IFX_PSI5_CH_SORH_SD40_LEN (1u)

/** \brief Mask for Ifx_PSI5_CH_SORH_Bits.SD40 */
#define IFX_PSI5_CH_SORH_SD40_MSK (0x1u)

/** \brief Offset for Ifx_PSI5_CH_SORH_Bits.SD40 */
#define IFX_PSI5_CH_SORH_SD40_OFF (8u)

/** \brief Length for Ifx_PSI5_CH_SORH_Bits.SD41 */
#define IFX_PSI5_CH_SORH_SD41_LEN (1u)

/** \brief Mask for Ifx_PSI5_CH_SORH_Bits.SD41 */
#define IFX_PSI5_CH_SORH_SD41_MSK (0x1u)

/** \brief Offset for Ifx_PSI5_CH_SORH_Bits.SD41 */
#define IFX_PSI5_CH_SORH_SD41_OFF (9u)

/** \brief Length for Ifx_PSI5_CH_SORH_Bits.SD42 */
#define IFX_PSI5_CH_SORH_SD42_LEN (1u)

/** \brief Mask for Ifx_PSI5_CH_SORH_Bits.SD42 */
#define IFX_PSI5_CH_SORH_SD42_MSK (0x1u)

/** \brief Offset for Ifx_PSI5_CH_SORH_Bits.SD42 */
#define IFX_PSI5_CH_SORH_SD42_OFF (10u)

/** \brief Length for Ifx_PSI5_CH_SORH_Bits.SD43 */
#define IFX_PSI5_CH_SORH_SD43_LEN (1u)

/** \brief Mask for Ifx_PSI5_CH_SORH_Bits.SD43 */
#define IFX_PSI5_CH_SORH_SD43_MSK (0x1u)

/** \brief Offset for Ifx_PSI5_CH_SORH_Bits.SD43 */
#define IFX_PSI5_CH_SORH_SD43_OFF (11u)

/** \brief Length for Ifx_PSI5_CH_SORH_Bits.SD44 */
#define IFX_PSI5_CH_SORH_SD44_LEN (1u)

/** \brief Mask for Ifx_PSI5_CH_SORH_Bits.SD44 */
#define IFX_PSI5_CH_SORH_SD44_MSK (0x1u)

/** \brief Offset for Ifx_PSI5_CH_SORH_Bits.SD44 */
#define IFX_PSI5_CH_SORH_SD44_OFF (12u)

/** \brief Length for Ifx_PSI5_CH_SORH_Bits.SD45 */
#define IFX_PSI5_CH_SORH_SD45_LEN (1u)

/** \brief Mask for Ifx_PSI5_CH_SORH_Bits.SD45 */
#define IFX_PSI5_CH_SORH_SD45_MSK (0x1u)

/** \brief Offset for Ifx_PSI5_CH_SORH_Bits.SD45 */
#define IFX_PSI5_CH_SORH_SD45_OFF (13u)

/** \brief Length for Ifx_PSI5_CH_SORH_Bits.SD46 */
#define IFX_PSI5_CH_SORH_SD46_LEN (1u)

/** \brief Mask for Ifx_PSI5_CH_SORH_Bits.SD46 */
#define IFX_PSI5_CH_SORH_SD46_MSK (0x1u)

