HAMES2-1st-3/TunnelComfortSystemTesting/include/tc37xa/IfxPsi5_bf.h
/** \brief Offset for Ifx_PSI5_INTSETB_Bits.SCRI4 */
#define IFX_PSI5_INTSETB_SCRI4_OFF (22u)

/** \brief Length for Ifx_PSI5_INTSETB_Bits.SCRI5 */
#define IFX_PSI5_INTSETB_SCRI5_LEN (1u)

/** \brief Mask for Ifx_PSI5_INTSETB_Bits.SCRI5 */
#define IFX_PSI5_INTSETB_SCRI5_MSK (0x1u)

/** \brief Offset for Ifx_PSI5_INTSETB_Bits.SCRI5 */
#define IFX_PSI5_INTSETB_SCRI5_OFF (23u)

/** \brief Length for Ifx_PSI5_INTCLRA_Bits.RSI */
#define IFX_PSI5_INTCLRA_RSI_LEN (1u)

/** \brief Mask for Ifx_PSI5_INTCLRA_Bits.RSI */
#define IFX_PSI5_INTCLRA_RSI_MSK (0x1u)

/** \brief Offset for Ifx_PSI5_INTCLRA_Bits.RSI */
#define IFX_PSI5_INTCLRA_RSI_OFF (0u)

/** \brief Length for Ifx_PSI5_INTCLRA_Bits.RDI */
#define IFX_PSI5_INTCLRA_RDI_LEN (1u)

/** \brief Mask for Ifx_PSI5_INTCLRA_Bits.RDI */
#define IFX_PSI5_INTCLRA_RDI_MSK (0x1u)

/** \brief Offset for Ifx_PSI5_INTCLRA_Bits.RDI */
#define IFX_PSI5_INTCLRA_RDI_OFF (1u)

/** \brief Length for Ifx_PSI5_INTCLRA_Bits.RBI */
#define IFX_PSI5_INTCLRA_RBI_LEN (1u)

/** \brief Mask for Ifx_PSI5_INTCLRA_Bits.RBI */
#define IFX_PSI5_INTCLRA_RBI_MSK (0x1u)

/** \brief Offset for Ifx_PSI5_INTCLRA_Bits.RBI */
#define IFX_PSI5_INTCLRA_RBI_OFF (2u)

/** \brief Length for Ifx_PSI5_INTCLRA_Bits.TEI */
#define IFX_PSI5_INTCLRA_TEI_LEN (1u)

/** \brief Mask for Ifx_PSI5_INTCLRA_Bits.TEI */
#define IFX_PSI5_INTCLRA_TEI_MSK (0x1u)

/** \brief Offset for Ifx_PSI5_INTCLRA_Bits.TEI */
#define IFX_PSI5_INTCLRA_TEI_OFF (3u)

/** \brief Length for Ifx_PSI5_INTCLRA_Bits.NBI */
#define IFX_PSI5_INTCLRA_NBI_LEN (1u)

/** \brief Mask for Ifx_PSI5_INTCLRA_Bits.NBI */
#define IFX_PSI5_INTCLRA_NBI_MSK (0x1u)

/** \brief Offset for Ifx_PSI5_INTCLRA_Bits.NBI */
#define IFX_PSI5_INTCLRA_NBI_OFF (4u)

/** \brief Length for Ifx_PSI5_INTCLRA_Bits.MEI */
#define IFX_PSI5_INTCLRA_MEI_LEN (1u)

/** \brief Mask for Ifx_PSI5_INTCLRA_Bits.MEI */
#define IFX_PSI5_INTCLRA_MEI_MSK (0x1u)

/** \brief Offset for Ifx_PSI5_INTCLRA_Bits.MEI */
#define IFX_PSI5_INTCLRA_MEI_OFF (5u)

/** \brief Length for Ifx_PSI5_INTCLRA_Bits.CRCI */
#define IFX_PSI5_INTCLRA_CRCI_LEN (1u)

/** \brief Mask for Ifx_PSI5_INTCLRA_Bits.CRCI */
#define IFX_PSI5_INTCLRA_CRCI_MSK (0x1u)

/** \brief Offset for Ifx_PSI5_INTCLRA_Bits.CRCI */
#define IFX_PSI5_INTCLRA_CRCI_OFF (6u)

/** \brief Length for Ifx_PSI5_INTCLRA_Bits.FWI */
#define IFX_PSI5_INTCLRA_FWI_LEN (1u)

/** \brief Mask for Ifx_PSI5_INTCLRA_Bits.FWI */
#define IFX_PSI5_INTCLRA_FWI_MSK (0x1u)

/** \brief Offset for Ifx_PSI5_INTCLRA_Bits.FWI */
#define IFX_PSI5_INTCLRA_FWI_OFF (7u)

/** \brief Length for Ifx_PSI5_INTCLRA_Bits.RUI */
#define IFX_PSI5_INTCLRA_RUI_LEN (1u)

/** \brief Mask for Ifx_PSI5_INTCLRA_Bits.RUI */
#define IFX_PSI5_INTCLRA_RUI_MSK (0x1u)

/** \brief Offset for Ifx_PSI5_INTCLRA_Bits.RUI */
#define IFX_PSI5_INTCLRA_RUI_OFF (8u)

/** \brief Length for Ifx_PSI5_INTCLRA_Bits.RMI */
#define IFX_PSI5_INTCLRA_RMI_LEN (1u)

/** \brief Mask for Ifx_PSI5_INTCLRA_Bits.RMI */
#define IFX_PSI5_INTCLRA_RMI_MSK (0x1u)

/** \brief Offset for Ifx_PSI5_INTCLRA_Bits.RMI */
#define IFX_PSI5_INTCLRA_RMI_OFF (9u)

/** \brief Length for Ifx_PSI5_INTCLRA_Bits.TPI */
#define IFX_PSI5_INTCLRA_TPI_LEN (1u)

/** \brief Mask for Ifx_PSI5_INTCLRA_Bits.TPI */
#define IFX_PSI5_INTCLRA_TPI_MSK (0x1u)

/** \brief Offset for Ifx_PSI5_INTCLRA_Bits.TPI */
#define IFX_PSI5_INTCLRA_TPI_OFF (10u)

/** \brief Length for Ifx_PSI5_INTCLRA_Bits.TPOI */
#define IFX_PSI5_INTCLRA_TPOI_LEN (1u)

/** \brief Mask for Ifx_PSI5_INTCLRA_Bits.TPOI */
#define IFX_PSI5_INTCLRA_TPOI_MSK (0x1u)

/** \brief Offset for Ifx_PSI5_INTCLRA_Bits.TPOI */
#define IFX_PSI5_INTCLRA_TPOI_OFF (11u)

/** \brief Length for Ifx_PSI5_INTCLRA_Bits.TSI */
#define IFX_PSI5_INTCLRA_TSI_LEN (1u)

/** \brief Mask for Ifx_PSI5_INTCLRA_Bits.TSI */
#define IFX_PSI5_INTCLRA_TSI_MSK (0x1u)

/** \brief Offset for Ifx_PSI5_INTCLRA_Bits.TSI */
#define IFX_PSI5_INTCLRA_TSI_OFF (12u)

/** \brief Length for Ifx_PSI5_INTCLRA_Bits.TSOI */
#define IFX_PSI5_INTCLRA_TSOI_LEN (1u)

/** \brief Mask for Ifx_PSI5_INTCLRA_Bits.TSOI */
#define IFX_PSI5_INTCLRA_TSOI_MSK (0x1u)

/** \brief Offset for Ifx_PSI5_INTCLRA_Bits.TSOI */
#define IFX_PSI5_INTCLRA_TSOI_OFF (13u)

/** \brief Length for Ifx_PSI5_INTCLRA_Bits.TOI */
#define IFX_PSI5_INTCLRA_TOI_LEN (1u)

/** \brief Mask for Ifx_PSI5_INTCLRA_Bits.TOI */
#define IFX_PSI5_INTCLRA_TOI_MSK (0x1u)

/** \brief Offset for Ifx_PSI5_INTCLRA_Bits.TOI */
#define IFX_PSI5_INTCLRA_TOI_OFF (14u)

/** \brief Length for Ifx_PSI5_INTCLRA_Bits.TOOI */
#define IFX_PSI5_INTCLRA_TOOI_LEN (1u)

/** \brief Mask for Ifx_PSI5_INTCLRA_Bits.TOOI */
#define IFX_PSI5_INTCLRA_TOOI_MSK (0x1u)

/** \brief Offset for Ifx_PSI5_INTCLRA_Bits.TOOI */
#define IFX_PSI5_INTCLRA_TOOI_OFF (15u)

/** \brief Length for Ifx_PSI5_INTCLRA_Bits.NFI */
#define IFX_PSI5_INTCLRA_NFI_LEN (1u)

/** \brief Mask for Ifx_PSI5_INTCLRA_Bits.NFI */
#define IFX_PSI5_INTCLRA_NFI_MSK (0x1u)

/** \brief Offset for Ifx_PSI5_INTCLRA_Bits.NFI */
#define IFX_PSI5_INTCLRA_NFI_OFF (16u)

/** \brief Length for Ifx_PSI5_INTCLRB_Bits.WSI0 */
#define IFX_PSI5_INTCLRB_WSI0_LEN (1u)

/** \brief Mask for Ifx_PSI5_INTCLRB_Bits.WSI0 */
#define IFX_PSI5_INTCLRB_WSI0_MSK (0x1u)

/** \brief Offset for Ifx_PSI5_INTCLRB_Bits.WSI0 */
#define IFX_PSI5_INTCLRB_WSI0_OFF (0u)

/** \brief Length for Ifx_PSI5_INTCLRB_Bits.WSI1 */
#define IFX_PSI5_INTCLRB_WSI1_LEN (1u)

/** \brief Mask for Ifx_PSI5_INTCLRB_Bits.WSI1 */
#define IFX_PSI5_INTCLRB_WSI1_MSK (0x1u)

/** \brief Offset for Ifx_PSI5_INTCLRB_Bits.WSI1 */
#define IFX_PSI5_INTCLRB_WSI1_OFF (1u)

/** \brief Length for Ifx_PSI5_INTCLRB_Bits.WSI2 */
#define IFX_PSI5_INTCLRB_WSI2_LEN (1u)

/** \brief Mask for Ifx_PSI5_INTCLRB_Bits.WSI2 */
#define IFX_PSI5_INTCLRB_WSI2_MSK (0x1u)

/** \brief Offset for Ifx_PSI5_INTCLRB_Bits.WSI2 */
#define IFX_PSI5_INTCLRB_WSI2_OFF (2u)

/** \brief Length for Ifx_PSI5_INTCLRB_Bits.WSI3 */
#define IFX_PSI5_INTCLRB_WSI3_LEN (1u)

/** \brief Mask for Ifx_PSI5_INTCLRB_Bits.WSI3 */
#define IFX_PSI5_INTCLRB_WSI3_MSK (0x1u)

/** \brief Offset for Ifx_PSI5_INTCLRB_Bits.WSI3 */
#define IFX_PSI5_INTCLRB_WSI3_OFF (3u)

