HAMES2-1st-3/TunnelComfortSystemTesting/include/tc37xa/IfxPsi5_bf.h
/** \brief Offset for Ifx_PSI5_RDISET_Bits.RDI16 */
#define IFX_PSI5_RDISET_RDI16_OFF (16u)

/** \brief Length for Ifx_PSI5_RDISET_Bits.RDI17 */
#define IFX_PSI5_RDISET_RDI17_LEN (1u)

/** \brief Mask for Ifx_PSI5_RDISET_Bits.RDI17 */
#define IFX_PSI5_RDISET_RDI17_MSK (0x1u)

/** \brief Offset for Ifx_PSI5_RDISET_Bits.RDI17 */
#define IFX_PSI5_RDISET_RDI17_OFF (17u)

/** \brief Length for Ifx_PSI5_RDISET_Bits.RDI18 */
#define IFX_PSI5_RDISET_RDI18_LEN (1u)

/** \brief Mask for Ifx_PSI5_RDISET_Bits.RDI18 */
#define IFX_PSI5_RDISET_RDI18_MSK (0x1u)

/** \brief Offset for Ifx_PSI5_RDISET_Bits.RDI18 */
#define IFX_PSI5_RDISET_RDI18_OFF (18u)

/** \brief Length for Ifx_PSI5_RDISET_Bits.RDI19 */
#define IFX_PSI5_RDISET_RDI19_LEN (1u)

/** \brief Mask for Ifx_PSI5_RDISET_Bits.RDI19 */
#define IFX_PSI5_RDISET_RDI19_MSK (0x1u)

/** \brief Offset for Ifx_PSI5_RDISET_Bits.RDI19 */
#define IFX_PSI5_RDISET_RDI19_OFF (19u)

/** \brief Length for Ifx_PSI5_RDISET_Bits.RDI20 */
#define IFX_PSI5_RDISET_RDI20_LEN (1u)

/** \brief Mask for Ifx_PSI5_RDISET_Bits.RDI20 */
#define IFX_PSI5_RDISET_RDI20_MSK (0x1u)

/** \brief Offset for Ifx_PSI5_RDISET_Bits.RDI20 */
#define IFX_PSI5_RDISET_RDI20_OFF (20u)

/** \brief Length for Ifx_PSI5_RDISET_Bits.RDI21 */
#define IFX_PSI5_RDISET_RDI21_LEN (1u)

/** \brief Mask for Ifx_PSI5_RDISET_Bits.RDI21 */
#define IFX_PSI5_RDISET_RDI21_MSK (0x1u)

/** \brief Offset for Ifx_PSI5_RDISET_Bits.RDI21 */
#define IFX_PSI5_RDISET_RDI21_OFF (21u)

/** \brief Length for Ifx_PSI5_RDISET_Bits.RDI22 */
#define IFX_PSI5_RDISET_RDI22_LEN (1u)

/** \brief Mask for Ifx_PSI5_RDISET_Bits.RDI22 */
#define IFX_PSI5_RDISET_RDI22_MSK (0x1u)

/** \brief Offset for Ifx_PSI5_RDISET_Bits.RDI22 */
#define IFX_PSI5_RDISET_RDI22_OFF (22u)

/** \brief Length for Ifx_PSI5_RDISET_Bits.RDI23 */
#define IFX_PSI5_RDISET_RDI23_LEN (1u)

/** \brief Mask for Ifx_PSI5_RDISET_Bits.RDI23 */
#define IFX_PSI5_RDISET_RDI23_MSK (0x1u)

/** \brief Offset for Ifx_PSI5_RDISET_Bits.RDI23 */
#define IFX_PSI5_RDISET_RDI23_OFF (23u)

/** \brief Length for Ifx_PSI5_RDISET_Bits.RDI24 */
#define IFX_PSI5_RDISET_RDI24_LEN (1u)

/** \brief Mask for Ifx_PSI5_RDISET_Bits.RDI24 */
#define IFX_PSI5_RDISET_RDI24_MSK (0x1u)

/** \brief Offset for Ifx_PSI5_RDISET_Bits.RDI24 */
#define IFX_PSI5_RDISET_RDI24_OFF (24u)

/** \brief Length for Ifx_PSI5_RDISET_Bits.RDI25 */
#define IFX_PSI5_RDISET_RDI25_LEN (1u)

/** \brief Mask for Ifx_PSI5_RDISET_Bits.RDI25 */
#define IFX_PSI5_RDISET_RDI25_MSK (0x1u)

/** \brief Offset for Ifx_PSI5_RDISET_Bits.RDI25 */
#define IFX_PSI5_RDISET_RDI25_OFF (25u)

/** \brief Length for Ifx_PSI5_RDISET_Bits.RDI26 */
#define IFX_PSI5_RDISET_RDI26_LEN (1u)

/** \brief Mask for Ifx_PSI5_RDISET_Bits.RDI26 */
#define IFX_PSI5_RDISET_RDI26_MSK (0x1u)

/** \brief Offset for Ifx_PSI5_RDISET_Bits.RDI26 */
#define IFX_PSI5_RDISET_RDI26_OFF (26u)

/** \brief Length for Ifx_PSI5_RDISET_Bits.RDI27 */
#define IFX_PSI5_RDISET_RDI27_LEN (1u)

/** \brief Mask for Ifx_PSI5_RDISET_Bits.RDI27 */
#define IFX_PSI5_RDISET_RDI27_MSK (0x1u)

/** \brief Offset for Ifx_PSI5_RDISET_Bits.RDI27 */
#define IFX_PSI5_RDISET_RDI27_OFF (27u)

/** \brief Length for Ifx_PSI5_RDISET_Bits.RDI28 */
#define IFX_PSI5_RDISET_RDI28_LEN (1u)

/** \brief Mask for Ifx_PSI5_RDISET_Bits.RDI28 */
#define IFX_PSI5_RDISET_RDI28_MSK (0x1u)

/** \brief Offset for Ifx_PSI5_RDISET_Bits.RDI28 */
#define IFX_PSI5_RDISET_RDI28_OFF (28u)

/** \brief Length for Ifx_PSI5_RDISET_Bits.RDI29 */
#define IFX_PSI5_RDISET_RDI29_LEN (1u)

/** \brief Mask for Ifx_PSI5_RDISET_Bits.RDI29 */
#define IFX_PSI5_RDISET_RDI29_MSK (0x1u)

/** \brief Offset for Ifx_PSI5_RDISET_Bits.RDI29 */
#define IFX_PSI5_RDISET_RDI29_OFF (29u)

/** \brief Length for Ifx_PSI5_RDISET_Bits.RDI30 */
#define IFX_PSI5_RDISET_RDI30_LEN (1u)

/** \brief Mask for Ifx_PSI5_RDISET_Bits.RDI30 */
#define IFX_PSI5_RDISET_RDI30_MSK (0x1u)

/** \brief Offset for Ifx_PSI5_RDISET_Bits.RDI30 */
#define IFX_PSI5_RDISET_RDI30_OFF (30u)

/** \brief Length for Ifx_PSI5_RDISET_Bits.RDI31 */
#define IFX_PSI5_RDISET_RDI31_LEN (1u)

/** \brief Mask for Ifx_PSI5_RDISET_Bits.RDI31 */
#define IFX_PSI5_RDISET_RDI31_MSK (0x1u)

/** \brief Offset for Ifx_PSI5_RDISET_Bits.RDI31 */
#define IFX_PSI5_RDISET_RDI31_OFF (31u)

/** \brief Length for Ifx_PSI5_NFISET_Bits.NFI0 */
#define IFX_PSI5_NFISET_NFI0_LEN (1u)

/** \brief Mask for Ifx_PSI5_NFISET_Bits.NFI0 */
#define IFX_PSI5_NFISET_NFI0_MSK (0x1u)

/** \brief Offset for Ifx_PSI5_NFISET_Bits.NFI0 */
#define IFX_PSI5_NFISET_NFI0_OFF (0u)

/** \brief Length for Ifx_PSI5_NFISET_Bits.NFI1 */
#define IFX_PSI5_NFISET_NFI1_LEN (1u)

/** \brief Mask for Ifx_PSI5_NFISET_Bits.NFI1 */
#define IFX_PSI5_NFISET_NFI1_MSK (0x1u)

/** \brief Offset for Ifx_PSI5_NFISET_Bits.NFI1 */
#define IFX_PSI5_NFISET_NFI1_OFF (1u)

/** \brief Length for Ifx_PSI5_NFISET_Bits.NFI2 */
#define IFX_PSI5_NFISET_NFI2_LEN (1u)

/** \brief Mask for Ifx_PSI5_NFISET_Bits.NFI2 */
#define IFX_PSI5_NFISET_NFI2_MSK (0x1u)

/** \brief Offset for Ifx_PSI5_NFISET_Bits.NFI2 */
#define IFX_PSI5_NFISET_NFI2_OFF (2u)

/** \brief Length for Ifx_PSI5_NFISET_Bits.NFI3 */
#define IFX_PSI5_NFISET_NFI3_LEN (1u)

/** \brief Mask for Ifx_PSI5_NFISET_Bits.NFI3 */
#define IFX_PSI5_NFISET_NFI3_MSK (0x1u)

/** \brief Offset for Ifx_PSI5_NFISET_Bits.NFI3 */
#define IFX_PSI5_NFISET_NFI3_OFF (3u)

/** \brief Length for Ifx_PSI5_NFISET_Bits.NFI4 */
#define IFX_PSI5_NFISET_NFI4_LEN (1u)

/** \brief Mask for Ifx_PSI5_NFISET_Bits.NFI4 */
#define IFX_PSI5_NFISET_NFI4_MSK (0x1u)

/** \brief Offset for Ifx_PSI5_NFISET_Bits.NFI4 */
#define IFX_PSI5_NFISET_NFI4_OFF (4u)

/** \brief Length for Ifx_PSI5_NFISET_Bits.NFI5 */
#define IFX_PSI5_NFISET_NFI5_LEN (1u)

/** \brief Mask for Ifx_PSI5_NFISET_Bits.NFI5 */
#define IFX_PSI5_NFISET_NFI5_MSK (0x1u)

/** \brief Offset for Ifx_PSI5_NFISET_Bits.NFI5 */
#define IFX_PSI5_NFISET_NFI5_OFF (5u)

/** \brief Length for Ifx_PSI5_NFISET_Bits.NFI6 */
#define IFX_PSI5_NFISET_NFI6_LEN (1u)

/** \brief Mask for Ifx_PSI5_NFISET_Bits.NFI6 */
#define IFX_PSI5_NFISET_NFI6_MSK (0x1u)

/** \brief Offset for Ifx_PSI5_NFISET_Bits.NFI6 */
#define IFX_PSI5_NFISET_NFI6_OFF (6u)

