HAMES2-1st-3/TunnelComfortSystemTesting/include/tc37xa/IfxPsi5_bf.h
/** \brief Mask for Ifx_PSI5_MEISET_Bits.MEI20 */
#define IFX_PSI5_MEISET_MEI20_MSK (0x1u)

/** \brief Offset for Ifx_PSI5_MEISET_Bits.MEI20 */
#define IFX_PSI5_MEISET_MEI20_OFF (20u)

/** \brief Length for Ifx_PSI5_MEISET_Bits.MEI21 */
#define IFX_PSI5_MEISET_MEI21_LEN (1u)

/** \brief Mask for Ifx_PSI5_MEISET_Bits.MEI21 */
#define IFX_PSI5_MEISET_MEI21_MSK (0x1u)

/** \brief Offset for Ifx_PSI5_MEISET_Bits.MEI21 */
#define IFX_PSI5_MEISET_MEI21_OFF (21u)

/** \brief Length for Ifx_PSI5_MEISET_Bits.MEI22 */
#define IFX_PSI5_MEISET_MEI22_LEN (1u)

/** \brief Mask for Ifx_PSI5_MEISET_Bits.MEI22 */
#define IFX_PSI5_MEISET_MEI22_MSK (0x1u)

/** \brief Offset for Ifx_PSI5_MEISET_Bits.MEI22 */
#define IFX_PSI5_MEISET_MEI22_OFF (22u)

/** \brief Length for Ifx_PSI5_MEISET_Bits.MEI23 */
#define IFX_PSI5_MEISET_MEI23_LEN (1u)

/** \brief Mask for Ifx_PSI5_MEISET_Bits.MEI23 */
#define IFX_PSI5_MEISET_MEI23_MSK (0x1u)

/** \brief Offset for Ifx_PSI5_MEISET_Bits.MEI23 */
#define IFX_PSI5_MEISET_MEI23_OFF (23u)

/** \brief Length for Ifx_PSI5_MEISET_Bits.MEI24 */
#define IFX_PSI5_MEISET_MEI24_LEN (1u)

/** \brief Mask for Ifx_PSI5_MEISET_Bits.MEI24 */
#define IFX_PSI5_MEISET_MEI24_MSK (0x1u)

/** \brief Offset for Ifx_PSI5_MEISET_Bits.MEI24 */
#define IFX_PSI5_MEISET_MEI24_OFF (24u)

/** \brief Length for Ifx_PSI5_MEISET_Bits.MEI25 */
#define IFX_PSI5_MEISET_MEI25_LEN (1u)

/** \brief Mask for Ifx_PSI5_MEISET_Bits.MEI25 */
#define IFX_PSI5_MEISET_MEI25_MSK (0x1u)

/** \brief Offset for Ifx_PSI5_MEISET_Bits.MEI25 */
#define IFX_PSI5_MEISET_MEI25_OFF (25u)

/** \brief Length for Ifx_PSI5_MEISET_Bits.MEI26 */
#define IFX_PSI5_MEISET_MEI26_LEN (1u)

/** \brief Mask for Ifx_PSI5_MEISET_Bits.MEI26 */
#define IFX_PSI5_MEISET_MEI26_MSK (0x1u)

/** \brief Offset for Ifx_PSI5_MEISET_Bits.MEI26 */
#define IFX_PSI5_MEISET_MEI26_OFF (26u)

/** \brief Length for Ifx_PSI5_MEISET_Bits.MEI27 */
#define IFX_PSI5_MEISET_MEI27_LEN (1u)

/** \brief Mask for Ifx_PSI5_MEISET_Bits.MEI27 */
#define IFX_PSI5_MEISET_MEI27_MSK (0x1u)

/** \brief Offset for Ifx_PSI5_MEISET_Bits.MEI27 */
#define IFX_PSI5_MEISET_MEI27_OFF (27u)

/** \brief Length for Ifx_PSI5_MEISET_Bits.MEI28 */
#define IFX_PSI5_MEISET_MEI28_LEN (1u)

/** \brief Mask for Ifx_PSI5_MEISET_Bits.MEI28 */
#define IFX_PSI5_MEISET_MEI28_MSK (0x1u)

/** \brief Offset for Ifx_PSI5_MEISET_Bits.MEI28 */
#define IFX_PSI5_MEISET_MEI28_OFF (28u)

/** \brief Length for Ifx_PSI5_MEISET_Bits.MEI29 */
#define IFX_PSI5_MEISET_MEI29_LEN (1u)

/** \brief Mask for Ifx_PSI5_MEISET_Bits.MEI29 */
#define IFX_PSI5_MEISET_MEI29_MSK (0x1u)

/** \brief Offset for Ifx_PSI5_MEISET_Bits.MEI29 */
#define IFX_PSI5_MEISET_MEI29_OFF (29u)

/** \brief Length for Ifx_PSI5_MEISET_Bits.MEI30 */
#define IFX_PSI5_MEISET_MEI30_LEN (1u)

/** \brief Mask for Ifx_PSI5_MEISET_Bits.MEI30 */
#define IFX_PSI5_MEISET_MEI30_MSK (0x1u)

/** \brief Offset for Ifx_PSI5_MEISET_Bits.MEI30 */
#define IFX_PSI5_MEISET_MEI30_OFF (30u)

/** \brief Length for Ifx_PSI5_MEISET_Bits.MEI31 */
#define IFX_PSI5_MEISET_MEI31_LEN (1u)

/** \brief Mask for Ifx_PSI5_MEISET_Bits.MEI31 */
#define IFX_PSI5_MEISET_MEI31_MSK (0x1u)

/** \brief Offset for Ifx_PSI5_MEISET_Bits.MEI31 */
#define IFX_PSI5_MEISET_MEI31_OFF (31u)

/** \brief Length for Ifx_PSI5_RSICLR_Bits.RSI0 */
#define IFX_PSI5_RSICLR_RSI0_LEN (1u)

/** \brief Mask for Ifx_PSI5_RSICLR_Bits.RSI0 */
#define IFX_PSI5_RSICLR_RSI0_MSK (0x1u)

/** \brief Offset for Ifx_PSI5_RSICLR_Bits.RSI0 */
#define IFX_PSI5_RSICLR_RSI0_OFF (0u)

/** \brief Length for Ifx_PSI5_RSICLR_Bits.RSI1 */
#define IFX_PSI5_RSICLR_RSI1_LEN (1u)

/** \brief Mask for Ifx_PSI5_RSICLR_Bits.RSI1 */
#define IFX_PSI5_RSICLR_RSI1_MSK (0x1u)

/** \brief Offset for Ifx_PSI5_RSICLR_Bits.RSI1 */
#define IFX_PSI5_RSICLR_RSI1_OFF (1u)

/** \brief Length for Ifx_PSI5_RSICLR_Bits.RSI2 */
#define IFX_PSI5_RSICLR_RSI2_LEN (1u)

/** \brief Mask for Ifx_PSI5_RSICLR_Bits.RSI2 */
#define IFX_PSI5_RSICLR_RSI2_MSK (0x1u)

/** \brief Offset for Ifx_PSI5_RSICLR_Bits.RSI2 */
#define IFX_PSI5_RSICLR_RSI2_OFF (2u)

/** \brief Length for Ifx_PSI5_RSICLR_Bits.RSI3 */
#define IFX_PSI5_RSICLR_RSI3_LEN (1u)

/** \brief Mask for Ifx_PSI5_RSICLR_Bits.RSI3 */
#define IFX_PSI5_RSICLR_RSI3_MSK (0x1u)

/** \brief Offset for Ifx_PSI5_RSICLR_Bits.RSI3 */
#define IFX_PSI5_RSICLR_RSI3_OFF (3u)

/** \brief Length for Ifx_PSI5_RSICLR_Bits.RSI4 */
#define IFX_PSI5_RSICLR_RSI4_LEN (1u)

/** \brief Mask for Ifx_PSI5_RSICLR_Bits.RSI4 */
#define IFX_PSI5_RSICLR_RSI4_MSK (0x1u)

/** \brief Offset for Ifx_PSI5_RSICLR_Bits.RSI4 */
#define IFX_PSI5_RSICLR_RSI4_OFF (4u)

/** \brief Length for Ifx_PSI5_RSICLR_Bits.RSI5 */
#define IFX_PSI5_RSICLR_RSI5_LEN (1u)

/** \brief Mask for Ifx_PSI5_RSICLR_Bits.RSI5 */
#define IFX_PSI5_RSICLR_RSI5_MSK (0x1u)

/** \brief Offset for Ifx_PSI5_RSICLR_Bits.RSI5 */
#define IFX_PSI5_RSICLR_RSI5_OFF (5u)

/** \brief Length for Ifx_PSI5_RSICLR_Bits.RSI6 */
#define IFX_PSI5_RSICLR_RSI6_LEN (1u)

/** \brief Mask for Ifx_PSI5_RSICLR_Bits.RSI6 */
#define IFX_PSI5_RSICLR_RSI6_MSK (0x1u)

/** \brief Offset for Ifx_PSI5_RSICLR_Bits.RSI6 */
#define IFX_PSI5_RSICLR_RSI6_OFF (6u)

/** \brief Length for Ifx_PSI5_RSICLR_Bits.RSI7 */
#define IFX_PSI5_RSICLR_RSI7_LEN (1u)

/** \brief Mask for Ifx_PSI5_RSICLR_Bits.RSI7 */
#define IFX_PSI5_RSICLR_RSI7_MSK (0x1u)

/** \brief Offset for Ifx_PSI5_RSICLR_Bits.RSI7 */
#define IFX_PSI5_RSICLR_RSI7_OFF (7u)

/** \brief Length for Ifx_PSI5_RSICLR_Bits.RSI8 */
#define IFX_PSI5_RSICLR_RSI8_LEN (1u)

/** \brief Mask for Ifx_PSI5_RSICLR_Bits.RSI8 */
#define IFX_PSI5_RSICLR_RSI8_MSK (0x1u)

/** \brief Offset for Ifx_PSI5_RSICLR_Bits.RSI8 */
#define IFX_PSI5_RSICLR_RSI8_OFF (8u)

/** \brief Length for Ifx_PSI5_RSICLR_Bits.RSI9 */
#define IFX_PSI5_RSICLR_RSI9_LEN (1u)

/** \brief Mask for Ifx_PSI5_RSICLR_Bits.RSI9 */
#define IFX_PSI5_RSICLR_RSI9_MSK (0x1u)

/** \brief Offset for Ifx_PSI5_RSICLR_Bits.RSI9 */
#define IFX_PSI5_RSICLR_RSI9_OFF (9u)

/** \brief Length for Ifx_PSI5_RSICLR_Bits.RSI10 */
#define IFX_PSI5_RSICLR_RSI10_LEN (1u)

/** \brief Mask for Ifx_PSI5_RSICLR_Bits.RSI10 */
#define IFX_PSI5_RSICLR_RSI10_MSK (0x1u)

